In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
myIndex = ['United States', 'Taiwan', 'Pakistan', 'Austria']
myData = [329500000, 23570000, 220900000, 8917000]

In [4]:
mySeries = pd.Series(data = myData, index = myIndex)
mySeries

United States    329500000
Taiwan            23570000
Pakistan         220900000
Austria            8917000
dtype: int64

In [5]:
mySeries['Taiwan'] #prints population of Taiwan

23570000

In [6]:
#converts index to dictionary
Q1 = {'United States': 329500000, 'Taiwan': 23570000, 'Pakistan': 220900000, 'Austria': 8917000} 
Q2 = {'United States': 329500000, 'Taiwan': 23570000, 'Pakistan': 220900000, 'Czechoslovakia': 10751122}

In [7]:
Pop_Q1 = pd.Series(Q1) 
Pop_Q2 = pd.Series(Q2)
Pop_Q1.keys() # get the keys of any series

Index(['United States', 'Taiwan', 'Pakistan', 'Austria'], dtype='object')

In [8]:
Pop_Q1 + Pop_Q2 # adds values, not the right way to

Austria                   NaN
Czechoslovakia            NaN
Pakistan          441800000.0
Taiwan             47140000.0
United States     659000000.0
dtype: float64

In [9]:
Pop_Q1.add(Pop_Q2, fill_value = 0) #proper way

Austria             8917000.0
Czechoslovakia     10751122.0
Pakistan          441800000.0
Taiwan             47140000.0
United States     659000000.0
dtype: float64

In [10]:
np.random.seed(101) #fixed random number
randval = np.random.randint(0,101,(4,3)) # generating random number from 0-101 with 4x3 ndimensional array
randval

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [11]:
myIndex = ['United States', 'Taiwan', 'Pakistan', 'Austria']
myColumns = ['Jan', 'Feb', 'Mar']
df = pd.DataFrame(data = randval, index = myIndex, columns = myColumns)
df

               Jan  Feb  Mar
United States   95   11   81
Taiwan          70   63   87
Pakistan        75    9   77
Austria         40    4   63

In [12]:
df = pd.read_csv('student.csv') # reads the data from the csv

In [13]:
df

    id      name  class  mark  gender
0    1      Jane   Four    75  female
1    2      John  Three    85    male
2    3    Arnold  Three    55    male
3    4    Sophia   Four    60  female
4    5    Amelia   Four    60  female
5    6     Chris   Four    55    male
6    7   Michael  Fifth    78    male
7    8      Liam   Five    85    male
8    9    Oliver    Six    78    male
9   10       Mia   Four    55  female
10  11     Belle    Six    89  female
11  12     Becky    Six    94  female
12  13     Chloe  Seven    88  female
13  14    Claire  Seven    88  female
14  15     James   Four    88    male
15  16  Benjamin   Four    88    male
16  17     Lucas    Six    54    male
17  18     Aaron   Five    75    male
18  19      Jack   Nine    18    male
19  20      Jill   Nine    65  female
20  21      Lucy   Four    69  female
21  22       Ivy  Seven    55  female
22  23     Jason  Eight    79    male
23  24    Isaiah  Seven    78    male
24  25    Andrew  Seven    88    male
25  26    Joshua  Seven    79    male
26  27     Sarah  Three    81  female
27  28    Hannah  Seven    86  female
28  29     Caleb  Seven    55    male
29  30  Jane Doe    Six    79  female
30  31      Ryan   Four    88    male
31  32      Mila  Seven    90  female
32  33     Ellie    Six    96  female
33  34  John Doe  Seven    69    male
34  35     Grace    Six    88  female

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    35 non-null     object
 2   class   35 non-null     object
 3   mark    35 non-null     int64
 4   gender  35 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB

In [15]:
df.columns

Index(['id', 'name', 'class', 'mark', 'gender'], dtype='object')

In [16]:
df.index

RangeIndex(start=0, stop=35, step=1)

In [17]:
df.head(2) # shows the first few rows according to the values you specified

   id  name  class  mark  gender
0   1  Jane   Four    75  female
1   2  John  Three    85    male

In [18]:
df.head(5)

   id    name  class  mark  gender
0   1    Jane   Four    75  female
1   2    John  Three    85    male
2   3  Arnold  Three    55    male
3   4  Sophia   Four    60  female
4   5  Amelia   Four    60  female

In [19]:
df.describe() # gives information on your data

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

In [20]:
df.describe().transpose()

      count       mean        std   min   25%   50%   75%   max
id     35.0  18.000000  10.246951   1.0   9.5  18.0  26.5  35.0
mark   35.0  74.657143  16.401117  18.0  62.5  79.0  88.0  96.0